""""""""""""""""""""""""""""
"1)掌握赋值语句内存分析方法"
"2)掌握id()和is使用方法    "
"3)了解python的垃圾回收机制"
"4)了解python的内存管理机制"
""""""""""""""""""""""""""""

#内存管理的重要性
#只有8G内存如何高效的分析上G的数据
#只有8G内存，为什么程序可以一直跑下去
#8G内存的背后，Python都做了些什么

"""
>>> a = 1
>>> id(a)
94021257755968
>>> b = 1
>>> id(b)
94021257755968
"""
"""
>>> a = 1
>>> b = 1
>>> print(a == b)
True
>>> print(a is b)
True
""" 
#比较小的值 和 字符串 内存是共用

"""
>>> a = []
>>> b = []
>>> a == b
True
>>> a is b
False
>>> id(a)
140510110831808
>>> id(b)
140510110831616
"""
#内存不共用 
